Revit 2027 API
StructuralSectionConcretePolygon.Sides Property
 Number of sides of the polygon contour.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Sides { get; set; }
Public Property Sides As Integer
	Get
	Set
public:
property int Sides {
	int get ();
	void set (int value);
}
member Sides : int with get, set
Property Value
Int32
See Also
Reference
StructuralSectionConcretePolygon Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace